package HomeWork07;

import java.util.Random;

public class Task_05 {
    public static void main(String[] args) {
        /*
        Task 5 * (Опционально)
Используйте оператор switch для решения задачи:
Ваш ребенок принес оценку за контрольную работу по математике.
В школе 12-балльная система. Запишите в переменную случайное число от 0 до 12.
Вы разрешаете ребенку смотреть телевизор не более 60 минут в день.
На сегодня у него осталось 45 минут.

Если оценка от 10 до 12 баллов: скажите ребенку, как вы рады,
и добавьте к оставшемуся времени 1 час.
Оценка от 7 до 9 баллов: похвалите ребенка и добавьте 45 минут.
Оценка от 4 до 6 баллов: нейтрально отнеситесь и добавьте 15 минут.
Оценка 3 балла: огорчитесь и вычтите 30 минут.
Оценка меньше 3 баллов: запретите телевизор на сегодня.
Выведите на экран оставшееся время для просмотра ТВ.

P.S. Проконтролируйте, чтобы ребенок не смотрел ТВ больше 60 минут в день.
         */
        Random random = new Random();
        int a = 45;
        int note = random.nextInt(13);
        switch (note){
            case 12:
            case 11:
            case 10:
                int b = a + 60;
                if(b>60){
                    b = 60;
                }
                System.out.println("очень рад " + note +" и добавляю тебе "+ 60 + ", но смотреть ты будешь " + b+" минут");
                break;
            case 9:
            case 8:
            case 7:
                b = a + 45;
                if(b>60){
                    b = 60;
                }
                System.out.println("хвалю тебя, " + note +" и добавляю тебе "+ 45 + ", но смотреть ты будешь " + b+" минут");
                break;
            case 6:
            case 5:
            case 4:
                b = a + 15;
                if(b>60){
                    b = 60;
                }
                System.out.println("ммм, ладно " + note +" и добавляю тебе "+ 15 + " и смотреть ты будешь " + b+" минут");
                break;
            case 3:
                System.out.println("я огорчен "+note +" и смотреть ты будешь "+(a - 30)+ " минут");
                break;
            default:
                System.out.println("сегодня ты без телевизора " +note);

        }
    }
}
